{
    "thomas-lo": {
        "driver": "Thomas Lo",
        "racingNumber": 88,
        "birthday": "2004.07.24",
        "cars": ["rh"],
        "description": "Thomas's interest in automotive sports began during his teenage years when his brother started driving \"enthusiatically\" with the family's 2002 Honda CR-V. This exposure to spirited driving ignited a curiosity that later grew through the racing simulator Assetto Corsa. Starting with a basic mouse-and-keyboard setup, he quickly became captivated by the complexity racing entailed. As his enthusiasm for racing grew, he upgraded to a sim wheel (Logitech G29), allowing him to explore more driving techniques and understand basic concepts of driving such as understeer and oversteer. His early foundations on simracing shaped his aggressive and pushing the limits style he enjoys today.<br><br>In 2022, Thomas enrolled at the University of California, Riverside, majoring in mechanical engineering. This academic pursuit provided him with the technical foundation to explore his hobby with an analytical style. By studying mechanical engineering Thomas gained a deeper understanding of how fluid dynamics and vehicle dynamics influence suspension and aerodynamic performance. This knowledge allowed him to analyze and appreciate how different aero and suspension setups impact a car's handling and overall behavior on the track.<br><img src=\"/drivers/assets/mechanical.jpg\" alt=\"mechanical engineering class\" /><br>With his brother's support and assistance, Thomas eventually purchased his own stock Honda S2000. Together, they embarked 1,500-mile road trip, through rain and snow. Prior to getting his own car, Thomas learned to drive manual on his brother Jonathan's S2000. At the same time, he also began learning how to ride motorcycles. Drawn in by the sheer fun and freedom both motorcycles and enthusiast cars offered, Thomas often cruised canyons with friends on popular roads such as Angeles Crest Highway and HWY - 39.<br><div class=\"p-img\"><img src=\"/drivers/assets/canyon.jpg\" alt=\"cars at a canyon\" /><img src=\"/drivers/assets/moto.jpg\" alt=\"thomas on a motorcycle\" /></div><br>By blending his technical expertise with his passion for driving, Thomas has carved out a unique and exciting path in the world of automotive sports. Today, he continues to refine his skills behind the wheel of his S2000, balancing technical mastery with his passion for racing, as he explores new tracks and challenges both virtually and in real life."
    },
    "jonathan-lo": {
        "driver": "Jonathan Lo",
        "racingNumber": 411,
        "birthday": "2002.04.11",
        "cars": [
            "hyperion"
        ],
        "description": "Jonathan grew up in San Diego, California, alongside his brother <a  href=\"/team/thomas-lo\">Thomas</a>. Unlike many car enthusiasts, he didn't spend his childhood idolizing supercars or hanging posters of Ferraris and McLarens on his bedroom walls. Instead, his world revolved around competitive swimming.<br><br>From the age of 8 to 20, Jonathan dedicated himself to the sport, spending countless hours training before and after school to become faster, stronger, and more efficient. By 13, he was competing in regional championships in Southern California, eventually reaching the semi-national circuit, known as Futures, by the end of his swimming career.<br><img src=\"/drivers/assets/swim.jpg\" alt=\"swim champs\" /><br>So how did someone with no initial interest in cars find himself immersed in the world of racing?<br><br>At 16, like most teenagers, Jonathan got his driver's license and inherited the family's 2002 Honda CR-V. What began as a purely utilitarian relationship—commuting to school and swim practices—evolved into something deeper. He started noticing the nuances of driving: throttle response, the feeling of G-forces while cornering, and the tactile connection with the car. His curiosity grew after discovering the iconic racing series <i>Initial D</i> and <i>Wangan Midnight</i>.<br><br>Late-night drives on San Diego's backroads became a ritual after swim practices. These winding routes ignited his passion for driving, leading him to research car mechanics, driving techniques like trail braking, and their real-world applications. Recognizing the limits of public roads, he transitioned to sim racing, starting with a G29 wheel, pedals, and <i>Assetto Corsa</i>.<br><img src=\"/drivers/assets/sim.jpg\" alt=\"sim racing\" /><br>At UC San Diego, Jonathan shifted his focus from swimming to his growing passion for racing. Sim racing became a central hobby, where he mastered courses like the Nürburgring Nordschleife and the <a href=\"https://shutokorevivalproject.com/\">Tokyo Metropolitan Expressway (SRP)</a>. His dedication paid off as he began posting top times on time attack leaderboards, piloting a virtual Honda S2000, dubbed “AP2 - Legendary.”<br><br>After graduating college, Jonathan rewarded himself with a 2007 Honda S2000 using savings from his internships. This car became his canvas for applying the fundamentals he had honed in the virtual world. A 10-week business trip to the Netherlands gave him his first taste of real-world track driving at the Nürburgring Nordschleife. On weekends, he also explored legendary circuits like Zandvoort and Spa-Francorchamps.<br><img src=\"/drivers/assets/nords.jpg\" alt=\"driving on the nords\" /><br>Upon returning to California, Jonathan dove into high-performance driving events (HPDE) and track days, with Streets of Willow becoming his home track. Today, he continues to push the limits of both his S2000 and his skills, striving to bring his dream car, “AP2 - Legendary,” to life while sharpening his craft on and off the track."
    }
}