{
    "thomas-lo": {
        "driver": "Thomas Lo",
        "racingNumber": 88,
        "car": "2006 Honda S2000",
        "birthday": "2004.07.24",
        "cars": ["rh"],
        "description": "Thomas Lo grew up in San Diego, California, with a childhood partially shaped by swimming. While he participated in competitive swimming alongside his peers, he never quite reached the same levels of success as some of his teammates. Instead, swimming served as a discipline that instilled in him a strong work ethic and perseverance, qualities that would later fuel his other passions.<br><br>Thomas's interest in automotive sports began during his teenage years, sparked by the racing simulator Assetto Corsa. Starting with a basic mouse-and-keyboard setup, he quickly became captivated by the intricacies of racing. As his skills and enthusiasm grew, he upgraded to a Logitech G29 wheel, pedals, and shifter, which allowed him to explore advanced driving techniques and deepen his understanding of racing dynamics.<br><br>In 2022, Thomas enrolled at the University of California, Riverside, majoring in mechanical engineering. This academic pursuit not only aligned with his analytical mindset but also provided him with the technical foundation to further explore his automotive hobbies. During his freshman year of college, Thomas also began lifting weights, developing physical strength and discipline alongside his intellectual pursuits. With the support and guidance of his brother, he eventually acquired his own car: a pristine, stock 2006 Honda S2000.<br><br>Before getting his own car, Thomas learned to drive manual on his brother Jonathan's S2000. This experience helped him build confidence and familiarity with the fundamentals of car control. After Jonathan acquired his S2000, Thomas began exploring local mountain passes, developing his driving skills on winding roads. These late-night runs provided valuable experience and an appreciation for the nuances of handling and precision. Over time, his focus shifted towards the controlled environment of track racing, where he could safely push the limits of his car and his abilities.<br><br>Thomas spent countless hours mastering iconic tracks on Assetto Corsa, such as the Nordschleife Nürburgring. His background in mechanical engineering gave him a deeper appreciation for the engineering marvels behind automotive design, which further fueled his passion for cars and racing. Alongside his love for cars, Thomas developed an interest in motorcycles, finding joy in the freedom and exhilaration they provide on open roads.<br><br>His journey from swimming to racing highlights the transformative power of exploration and persistence. By blending his technical expertise with his passion for driving, Thomas has carved out a unique and exciting path in the world of automotive sports. Today, he continues to refine his skills behind the wheel of his S2000, balancing technical mastery with his passion for racing, as he explores new tracks and challenges both virtually and in real life."
    },
    "jonathan-lo": {
        "driver": "Jonathan Lo",
        "racingNumber": 411,
        "car": "2007 Honda S2000",
        "birthday": "2002.04.11",
        "cars": [
            "hyperion"
        ],
        "description": "Jonathan grew up in San Diego, California, alongside his brother <a  href=\"/team/thomas-lo\">Thomas</a>. Unlike many car enthusiasts, he didn't spend his childhood idolizing supercars or hanging posters of Ferraris and McLarens on his bedroom walls. Instead, his world revolved around competitive swimming.<br><br>From the age of 8 to 20, Jonathan dedicated himself to the sport, spending countless hours training before and after school to become faster, stronger, and more efficient. By 13, he was competing in regional championships in Southern California, eventually reaching the semi-national circuit, known as Futures, by the end of his swimming career.<br><img src=\"/drivers/assets/swim.jpg\" alt=\"swim champs\" /><br>So how did someone with no initial interest in cars find himself immersed in the world of racing?<br><br>At 16, like most teenagers, Jonathan got his driver's license and inherited the family's 2002 Honda CR-V. What began as a purely utilitarian relationship—commuting to school and swim practices—evolved into something deeper. He started noticing the nuances of driving: throttle response, the feeling of G-forces while cornering, and the tactile connection with the car. His curiosity grew after discovering the iconic racing series <i>Initial D</i> and <i>Wangan Midnight</i>.<br><br>Late-night drives on San Diego's backroads became a ritual after swim practices. These winding routes ignited his passion for driving, leading him to research car mechanics, driving techniques like trail braking, and their real-world applications. Recognizing the limits of public roads, he transitioned to sim racing, starting with a G29 wheel, pedals, and <i>Assetto Corsa</i>.<br><img src=\"/drivers/assets/sim.jpg\" alt=\"sim racing\" /><br>At UC San Diego, Jonathan shifted his focus from swimming to his growing passion for racing. Sim racing became a central hobby, where he mastered courses like the Nürburgring Nordschleife and the <a href=\"https://shutokorevivalproject.com/\">Tokyo Metropolitan Expressway (SRP)</a>. His dedication paid off as he began posting top times on time attack leaderboards, piloting a virtual Honda S2000, dubbed “AP2 - Legendary.”<br><br>After graduating college, Jonathan rewarded himself with a 2007 Honda S2000 using savings from his internships. This car became his canvas for applying the fundamentals he had honed in the virtual world. A 10-week business trip to the Netherlands gave him his first taste of real-world track driving at the Nürburgring Nordschleife. On weekends, he also explored legendary circuits like Zandvoort and Spa-Francorchamps.<br><img src=\"/drivers/assets/nords.jpg\" alt=\"driving on the nords\" /><br>Upon returning to California, Jonathan dove into high-performance driving events (HPDE) and track days, with Streets of Willow becoming his home track. Today, he continues to push the limits of both his S2000 and his skills, striving to bring his dream car, “AP2 - Legendary,” to life while sharpening his craft on and off the track."
    }
}